//: Playground - noun: a place where people can play

import Cocoa

                            /* While 循环 */
/* -------------------------------------------------------------------
 
    while循环会一直运行一段语句直到条件变成false。这类循环适合使用在第一次迭代前，迭代次数未知的情况下。
 
    Swift提供两种while循环形式：
        -> while循环：每次在循环开始时计算条件是否符合
        -> repeat-while循环：每次在循环结束时计算条件是否符合
 
 ------------------------------------------------------------------ */


                            /* while */
/* -------------------------------------------------------------------

    while循环从计算一个条件开始，如果条件为true，会重复运行一段语句，直到条件变为false。
 
    while循环的一般格式：
    while condition {
 
        // 代码块
    }
 
 ------------------------------------------------------------------ */

