//: Playground - noun: a place where people can play

import UIKit

                            /* 条件语句 */
/* -------------------------------------------------------------------
 
    Swift提供两种类型条件语句：
        if 和 switch，通常条件较为简单时，使用if语句。而switch语句更适合条件
        更为复杂的、有更多排列组合的时候。并且switch在需要用到模式匹配的情况下
        会更有用。
 ------------------------------------------------------------------ */

                            /* If */
/* -------------------------------------------------------------------
 
    if语句最简单的形式就是只包含一个条件，只有该条件为true时，才执行相关代码。
 
 ------------------------------------------------------------------ */
var todayTemperature = -10
if todayTemperature <= 0 {
    print("today's temperature is \(todayTemperature), it's very code")
} else {

    print("suck my dick")
}

var isLong = true
if !isLong {

    print("fuck off")
} else {

    print("suole my penis")
}


                            /* Switch */
/* -------------------------------------------------------------------
 
    switch语句会尝试把某个值与若干模式进行匹配，根据第一个匹配成功的模式，
    switch语句会执行对应的代码
 
 ------------------------------------------------------------------ */

